# Pandas

# Pandas define dataframe and add row

In [9]:
import pandas as pd
df  = pd.DataFrame(columns = ['digit', 'idx'])
df.loc[0] = [1, 2]
df

  digit idx
0     1   2

Add columns - two different ways

In [23]:
df['new_col'] = ""
df = df.assign(new_col2='')
df

   name                time new_col new_col2
0  John 2021-01-01 10:13:16
1  Jane 2020-01-01 10:13:16

Drop columns

In [25]:
df.drop(columns=['time'])

   name new_col new_col2
0  John
1  Jane

Drop rows

In [26]:
df.drop([0])

   name                time new_col new_col2
1  Jane 2020-01-01 10:13:16

# Pandas loc vs iloc

In [24]:
import pandas as pd
import numpy as np
df  = pd.DataFrame(columns = ['digit', 'number'])
df.digit = np.linspace(1,10,10)
df.number = np.linspace(100,110,10)
df = df[df.digit.between(3,5)]
df

   digit      number
2    3.0  102.222222
3    4.0  103.333333
4    5.0  104.444444

### iloc access a relative index after filtering

In [25]:
df.iloc[0] #il

digit       3.000000
number    102.222222
Name: 2, dtype: float64

### loc access global index and therefore gives error after filtering

In [26]:
df.loc[3]

digit       4.000000
number    103.333333
Name: 3, dtype: float64

# Select both rows and columns

In [29]:
import pandas as pd
df = pd. DataFrame()
df['idx'] =  ['BR', 'RU', 'IN']
df['country'] = ['Brazil', 'Russia', 'India']
df['capital'] = ['Brassilia', 'Russia', 'India']
df.loc[1:, ['country', 'capital']]

  country capital
1  Russia  Russia
2   India   India

# Assign value to cells

In [31]:
df.loc[1:, ['country', 'capital']] = 'USA'
df

  idx country    capital
0  BR  Brazil  Brassilia
1  RU     USA        USA
2  IN     USA        USA

Assign multiple values in a single row and multiple columns

In [34]:
import pandas as pd
df  = pd.DataFrame(columns = ['digit', 'idx', 'num'])
df.loc[0] = [0,1,2]
df.loc[0, ['idx', 'num']] = [4,5]
df

  digit idx num
0     0   4   5

Assign multiple rows to a series

In [35]:
x = df.loc[0]
x.loc[['idx', 'num']] = [4,5]
x

digit    0
idx      4
num      5
Name: 0, dtype: object

## pandas groupby

group by first element in a columns

In [29]:
import pandas as pd
import numpy as np
df  = pd.DataFrame(columns = ['digit', 'number'])
df.digit = [1,1,2,2,3,3,4,4,5,5]
df.number = np.linspace(100,110,10)
df

   digit      number
0      1  100.000000
1      1  101.111111
2      2  102.222222
3      2  103.333333
4      3  104.444444
5      3  105.555556
6      4  106.666667
7      4  107.777778
8      5  108.888889
9      5  110.000000

In [31]:
df = df.groupby('digit').first().reset_index()
df

   digit      number
0      1  100.000000
1      2  102.222222
2      3  104.444444
3      4  106.666667
4      5  108.888889

# pandas load and save dataframe as csv

In [37]:
import pandas as pd
import numpy as np
df  = pd.DataFrame(columns = ['digit', 'number'])
df.digit = [1,1,2,2,3,3,4,4,5,5]
df.number = np.linspace(100,110,10)
df.to_csv('example_table.csv',index=False)
df2 = pd.read_csv('example_table.csv')
df2

   digit      number
0      1  100.000000
1      1  101.111111
2      2  102.222222
3      2  103.333333
4      3  104.444444
5      3  105.555556
6      4  106.666667
7      4  107.777778
8      5  108.888889
9      5  110.000000

# pandas apply

## Apply function using a single column

In [1]:
import pandas as pd
df  = pd.DataFrame(columns = ['digit', 'idx'])
df.digit = [12, 124, 1222, 122]
df.idx = [0, 10, 20, 30]

df['applied'] = df.digit.apply(lambda x: x + 5)
df

   digit  idx  applied
0     12    0       17
1    124   10      129
2   1222   20     1227
3    122   30      127

## Apply function using all columns

In [38]:
import pandas as pd
df  = pd.DataFrame(columns = ['digit', 'idx'])
df.digit = [12, 124, 1222, 122]
df.idx = [0, 10, 20, 30]

df['applied'] = df.apply(lambda x: x['digit'] + 5, axis=1)
df

   digit  idx  applied
0     12    0       17
1    124   10      129
2   1222   20     1227
3    122   30      127

## pandas apply custom function

In [39]:
import pandas as pd
df  = pd.DataFrame(columns = ['digit', 'idx'])
df.digit = [12, 124, 1222, 122]
df.idx = [0, 10, 20, 30]

def my_custom_function(x):
    return x['digit']+5
df['applied'] = df.apply(lambda x: my_custom_function(x), axis=1)
df

   digit  idx  applied
0     12    0       17
1    124   10      129
2   1222   20     1227
3    122   30      127

## Pandas apply return multiple output using "expand"

In [3]:
import pandas as pd
df  = pd.DataFrame(columns = ['digit', 'idx'])
df.digit = [12, 124, 1222, 122]
df.idx = [0, 10, 20, 30]

df[['applied1', 'applied2']] = df.apply(lambda x: [x['digit'] + 5, 132], axis=1, result_type='expand')
df

   digit  idx  applied1  applied2
0     12    0        17       132
1    124   10       129       132
2   1222   20      1227       132
3    122   30       127       132

# pandas sort rows in df1 by df2

In [40]:
df1 = pd.DataFrame({'name' : ['A', 'Z','C'],
                   'company' : ['Apple', 'Yahoo','Amazon'],
                   'height' : [130, 150,173]})

df1

  name company  height
0    A   Apple     130
1    Z   Yahoo     150
2    C  Amazon     173

In [41]:
df2 = pd.DataFrame({'name' : ['Z', 'C', 'A'],
                   'x' : [5, 4,3],
                   'y' : [1, 11,111]})
df2

  name  x    y
0    Z  5    1
1    C  4   11
2    A  3  111

In [42]:
df1 = df1.set_index('name').reindex(list(df2.name)).reset_index()
assert list(df1.name) == list(df2.name)
df1

  name company  height
0    Z   Yahoo     150
1    C  Amazon     173
2    A   Apple     130

#  Sort values

Original data frame

In [20]:
import pandas as pd
df = pd.DataFrame()
df['A'] = [10,2]
df['B'] = [3,4]
display(df)

    A  B
0  10  3
1   2  4

sort a data frame

In [22]:
df.sort_values('A', ascending=True)
df

    A  B
0  10  3
1   2  4

Without i

# Multi index slicing

In [2]:
import numpy as np, pandas as pd
mux = pd.MultiIndex.from_arrays([
    list('aaaabbbb'),
    list('tuvwtuvw')
], names=['one', 'two'])

df = pd.DataFrame({'col': np.arange(len(mux))}, mux)
display(df)
df.loc[('b','u')]

         col
one two
a   t      0
    u      1
    v      2
    w      3
b   t      4
    u      5
    v      6
    w      7

col    5
Name: (b, u), dtype: int32

## Multi index to columns

In [6]:
df.reset_index().tail()

  one two  col
3   a   w    3
4   b   t    4
5   b   u    5
6   b   v    6
7   b   w    7

# Manipulating time

Convert time delta to hours

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(columns = ['name', 'admission_time', 'discharge_time', 'hours'])
df.name = ['John']
df.admission_time = pd.Timestamp('2021-01-1 22:12:41')
df.discharge_time = pd.Timestamp('2021-01-2 23:12:41')

df.hours = (df.discharge_time - df.admission_time)/ np.timedelta64(1, 'h')
df

   name      admission_time      discharge_time  hours
0  John 2021-01-01 22:12:41 2021-01-02 23:12:41   25.0

Extract year using DatetimeIndex

In [9]:
import pandas as pd
import numpy as np
df = pd.DataFrame()
df['name'] = ['John', 'Jane']
df['time'] = [pd.Timestamp('2021-01-1 10:13:16'), pd.Timestamp('2020-01-1 10:13:16')]
df['year'] = pd.DatetimeIndex(df['time']).year

Filter rows by dates

In [14]:
import pandas as pd
import numpy as np
df = pd.DataFrame()
df['name'] = ['John', 'Jane']
df['time'] = [pd.Timestamp('2021-01-1 10:13:16'), pd.Timestamp('2020-01-1 10:13:16')]
df

   name                time
0  John 2021-01-01 10:13:16
1  Jane 2020-01-01 10:13:16

In [13]:
df[pd.DatetimeIndex(df['time']).year<=2020]b

   name                time
1  Jane 2020-01-01 10:13:16

In [17]:
df[df['time']<pd.Timestamp('2021')]

   name                time
1  Jane 2020-01-01 10:13:16

# Pandas increase the number of rows displayed

Display fully dataframes of up to 200 rows:

In [7]:
pd.set_option('display.max_rows', 200)

In [8]:
import pandas as pd, numpy as np
df = pd.DataFrame()
df['numbers'] = np.linspace(1,20,20)
df

    numbers
0       1.0
1       2.0
2       3.0
3       4.0
4       5.0
5       6.0
6       7.0
7       8.0
8       9.0
9      10.0
10     11.0
11     12.0
12     13.0
13     14.0
14     15.0
15     16.0
16     17.0
17     18.0
18     19.0
19     20.0

# Pandas dropna

In [24]:
import pandas as pd, numpy as np
df = pd.DataFrame()
df['col0'] = [1, 2, 3, 4]
df['col1'] = [5, 6, float("nan"), float("nan")]
df['col2'] = [9, 10, float("nan"), 12]

df

   col0  col1  col2
0     1   5.0   9.0
1     2   6.0  10.0
2     3   NaN   NaN
3     4   NaN  12.0

Drop rows that have all Nan in the subset of col2 and col3

In [25]:
df.dropna(how='all', subset=['col1', 'col2'])

   col0  col1  col2
0     1   5.0   9.0
1     2   6.0  10.0
3     4   NaN  12.0

# Pandas merge

In [47]:
import pandas as pd, numpy as np

df = pd.DataFrame()
df['Country'] = ['USA', 'Georgia', 'Israel']
df['City'] = ['Durham', 'Tbilisi', 'Jerusalem']
display(df)

df2 = pd.DataFrame()
df2['Country'] = ['Georgia', 'Israel']
df2['Food'] = ['Hachapuri', 'Humus']
display(df2)

   Country       City
0      USA     Durham
1  Georgia    Tbilisi
2   Israel  Jerusalem

   Country       Food
0  Georgia  Hachapuri
1   Israel      Humus

Merge outer

In [48]:
df.merge(df2, how='outer')

   Country       City       Food
0      USA     Durham        NaN
1  Georgia    Tbilisi  Hachapuri
2   Israel  Jerusalem      Humus

Merge inner

In [49]:
df.merge(df2, how='inner')

   Country       City       Food
0  Georgia    Tbilisi  Hachapuri
1   Israel  Jerusalem      Humus

# Pandas rename a columns

In [63]:
import pandas as pd, numpy as np

df = pd.DataFrame()
df['Country'] = ['USA', 'Georgia', 'Israel']
df['City'] = ['Durham', 'Tbilisi', 'Jerusalem']
display(df)

df = df.rename({'Country':'Visited countries'}, axis='columns')
df

   Country       City
0      USA     Durham
1  Georgia    Tbilisi
2   Israel  Jerusalem

  Visited countries       City
0               USA     Durham
1           Georgia    Tbilisi
2            Israel  Jerusalem

# Define pandas series

In [67]:
import pandas as pd
my_series = pd.Series(dtype=float)
my_series['field a'] = 1.
my_series['field b'] = 2.
my_series

field a    1.0
field b    2.0
dtype: float64

# Pandas read/write to json keeps the original datatype of a dataframe

In [91]:
df = pd.DataFrame(columns=['col1', 'col2'])
df['col1'] = [1, 2]
df['col2'] = [1, np.ones([3,3])]
df.to_json('my_json_from_df.json', indent=4)
df2 = pd.read_json('my_json_from_df.json')
display(df2.loc[1, 'col2'])
type(df2.loc[1, 'col2'])

[[1.0, 1.0, 1.0], [1.0, 1.0, 1.0], [1.0, 1.0, 1.0]]

list

# all() and any()

In [59]:
df = pd.DataFrame(columns=['col1', 'col2', 'col3'])
df.col1 = [1,2]
df.col2 = [1, float('nan')]
df.col3 = [float('nan'), float('nan')]
display(df)
display('Check if any value in a columns is Nan', df.isnull().any())
display('Check if all value in a columns is Nan', df.isnull().all())

   col1  col2  col3
0     1   1.0   NaN
1     2   NaN   NaN

'Check if any value in a columns is Nan'

col1    False
col2     True
col3     True
dtype: bool

'Check if all value in a columns is Nan'

col1    False
col2    False
col3     True
dtype: bool

replace a column of all nans with zeroes

In [60]:
df[df.columns[df.isnull().all()]] = df[df.columns[df.isnull().all()]].fillna(0)
df

   col1  col2  col3
0     1   1.0   0.0
1     2   NaN   0.0

Inplace

In [41]:
import pandas as pd
import numpy as np
df  = pd.DataFrame(columns = ['digit', 'number'])
df.digit = np.linspace(1,10,10)
df.number = np.linspace(100,110,10)
df = df[df.digit.between(3,5)]
df.drop(columns=['number'], inplace=False) # do nothing to df
display(df)
df.drop(columns=['number'], inplace=True) # update df
display(df)

   digit      number
2    3.0  102.222222
3    4.0  103.333333
4    5.0  104.444444

   digit
2    3.0
3    4.0
4    5.0

# Melt - multiple columns to one long columns

In [10]:
import pandas as pd
df = pd.DataFrame()
df['slide_name'] = list(range(1000,1005,1))
df['idx_0'] = [1, 3, 4, 6, 13]
df['idx_1'] = [14, 31, 42, 46, 53]
df

   slide_name  idx_0  idx_1
0        1000      1     14
1        1001      3     31
2        1002      4     42
3        1003      6     46
4        1004     13     53

In [17]:
df2 = pd.melt(df, id_vars=['slide_name'], value_vars=["idx_0", "idx_1"]).drop(columns=['variable'])
df2 = df2.rename(columns={'value':'idx'})
df2

   slide_name  idx
0        1000    1
1        1001    3
2        1002    4
3        1003    6
4        1004   13
5        1000   14
6        1001   31
7        1002   42
8        1003   46
9        1004   53